      * ------------------------------------------------------------
      * Customer's repord description
      *  -Record's length : 133
      * ------------------------------------------------------------
       01 ODCSFR-RECORD                PIC X(133).
      * ------------------------------------------------------------
      
