      * ------------------------------------------------------------
      * Customer's repord description
      *  -Record's length : 133
      * ------------------------------------------------------------
       01 MW-SYSOUT.
         02  SYSOUT-FIL               PIC X(133).
      * ------------------------------------------------------------
      
